{
    "case title": "An Ember of Distraction",
    "date": "London, 14th August 1885",
    "intro": "We are sitting by the fire in 221B Baker Street idly discussing anything of interest in the papers or on the streets that might lift Holmes from one of his dark moods[cite: 294]. Holmes has not partaken of the conversation, instead flitting between the paper, plucking a few discordant notes on his Stradivarius, mixing some noxious concoction with his Chemistry set, knocking his pipe against the mantel, and staring out of the window[cite: 295].\n\n\"Enough!\" Holmes exclaims. \"Take your infernal twittering elsewhere. It is disconcerting enough that a person must endure the ramblings of imbeciles at the best of times, but...\" [cite: 296]\n\nHolmes is interrupted by the clock on the mantel chiming the hour[cite: 297]. Before it can sound the third bell, Holmes picks it up and dashes it against the wall[cite: 297].\n\nAs we collect our coats and move to hurry from the room a singular police whistle is heard[cite: 298]. Holmes steps to the window as a carriage races past, turning sharply left on to Blanford Street[cite: 299].\n\n\"Hmm,\" we hear him mutter, \"perhaps there is some interest in the day after all...\" [cite: 300]",
    "outro": "We are in the sitting room of 221B Baker street when Holmes comes in full of Vim and vigour, a sharp contrast to the restless and irritated state he exhibited the last time we saw him[cite: 659].\n\n\"Ah, Watson,\" he extolls, \"an amusing distraction indeed, wouldn't you say?\" [cite: 660]\n\n\"Quite,\" responds Watson, \"but what was it all about?\"\n\n\"Well, while we wait on Mr. Epsoms I can expound upon my discoveries[cite: 661]. When we first saw the carriage hurtling past us, it occurred to me to consider which was more important; where the miscreant was headed, or where had he been! Tracing the route backwards I found myself at the old workhouse, and in particular the attached orphanage that had been set on fire!\" [cite: 662]\n\n\"Another of these damned arson attacks, I suppose?\" interjects Watson[cite: 663].\n\n\"One might think so. Perhaps even one might be being led to believe so, but in this instance I suspect not[cite: 664]. For one, the location. While the various buildings that have been targeted do not share a purpose, or, indeed, any relation to each other, they were invariably located closer to the river. The orphanage, being on Paddington Street represents either a divergence in the arsonists location, or is merely someone using these fires as a cover for some other dark deed. For another, the occupants of the orphanage had, at some expense, been sent out of harms way, an action which places our arsonist in the malicious, but not callously malevolent category. On tracking the orphans to Madame Tussauds, I discovered that their trip had been generously paid for by Lord Goodwin, which is surprising, given his sudden death last week. If this excursion was not funded by Lord Goodwin, then by whom and why?\n\n\"But what on earth does who paid for a trip have to do with the carriage dashing past us?\"\n\n\"What indeed, Watson. Given the timing, we can presume that whoever set the fire was also the occupant of the carriage[cite: 667]. Now, having set a fire, why would one choose to have such an obvious escape from the scene of the crime? Why surely only to get somewhere quickly rather than away from somewhere, else why not simply slope round a corner and disappear into the alleys of London town?When you consider the contents of the pocket ripped open by the officer in his attempt to apprehend our fleeing lord, there can be only one logical explanation[cite: 670].\"\n\n\"A burned cork and half a pawn slip? What can that tell us?\" [cite: 671]\n\n\"Why, Watson, it can tell us everything. The burned cork is a trick commonly used by music hall entertainers to create their make-up, specifically the black and white minstrels currently performing at St. James Hall and whose matinee performance starts at three O'clock[cite: 672]. What better alibi could one have that to be on stage in front of a paying audience at the time a fire was discovered[cite: 673]. A slow taper in an empty orphanage, a discreet walk away from the scene of the crime, and a hall full of witnesses willing to swear that you were on stage at the time of the fire[cite: 674]. Alas, this plan was foiled by the simple expedient of mischievous children hiding their fellow orphans' shoes, meaning the building was only empty later than anticipated, causing him to rush to form his alibi, ironically drawing attention to himself on the way.\"\n\n\"But that doesn't explain why he would be setting fire to an orphanage at all?\"\n\n\"Well, of course it does! However, if you need further clarification then I believe the man who can give it to you has now arrived[cite: 677].\"\n\nAt this pronouncement the door opens and Mrs. Hudson ushers in a short, balding man in his late fifties.\n\n\"Sherlock Holmes, I presume?\" he asks in a reedy voice \"Can I ask why I have been summoned at this time? I have only a few moments, as I have a very important engagement to attend imminently[cite: 678].\"\n\n\"A few moments is all I require, good sir. Gentlemen, this is Rory Epsoms who, as he was in the process of informing us, is on his way to read the last will and testament of the late Harold Goodwin, is that correct?\" [cite: 679]\n\n\"Yes it is, but that is hardly a secret given that it has been advertised in the newspaper.\"\n\n\"You are, of course, correct\" affirms Holmes, who is only spurred on by the confused looks he is getting from Watson. \"At the reading of the will, there will be a young man declaring himself to be Lord Goodwin's long lost son, Hildebrand[cite: 679]. Any evidence he has will no doubt be a forgery, and you would do well to have him arrested for the wilful destruction of The Marylebone Workhouse Orphanage by fire this afternoon[cite: 680]. You can inform Inspector Gregson that corroborating identification can be gained from Arthur Gallimore of the Moore and Burgess Minstrels, and The Williams Brothers Pawnbroker, where he exchanged his instrument, most likely a banjo, for enough money to pay for numerous tickets to madam Tussauds[cite: 681].\"\n\n\"But Holmes,\" cries Watson, \"even if this man does present himself and is fraudulent as you claim, why on earth would he bring attention to himself by burning down an orphanage of all places?\"\n\n\"Why, the answer is elementary. If you were to look at the records of the orphanage, you would discover that the man in question was a former ward of the very institution he attempted to destroy, and they would clearly indicate his parentage and the circumstances of his admittance[cite: 682]. However, this is no longer possible, as the only evidence to prove definitively that he is not who he is about to claim himself to be, has been destroyed in the fire[cite: 683].\"\n\n\"So who is he?\" asks Wiggins\n\n\"I have no idea. His identity is a mere triviality that does not require the mind of the world's greatest detective to discover, let the police discover that and enjoy the feeling of accomplishment that accompanies such minor discovery\" [cite: 684]\n\n\"And what about the other fires? Surely he can't be responsible for them too?\" [cite: 685]\n\n\"No, Watson. As I said earlier, this fire was nothing to do with our serial arsonist, but there is no mystery whatsoever to those; even Wiggins can explain those, yes?\" [cite: 686]\n\n\"Well,\" said Wiggins, \"actually, we might have an idea about that...\"",
    "case_summary": {
        "leads": [
            {"name": "44NW (Orphanage Fire/Clues)"},
            {"name": "46NW (Madame Tussauds/Orphans)"},
            {"name": "73NW (Goodwin Residence/Butler)"},
            {"name": "22NW (St James Hall/Gallimore)"}
        ],
        "case_description": "Holmes solved this case in 4 leads[cite: 688]."
    }
}